// questions.js
export const questions = [
    {
        text: 'Наблюдается ли у пациентки хроническая усталость или утомляемость, связанная с лечением?',
        options: [
            {label: 'Да', values: [1, 2, 1, 2]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Испытывает ли пациентка трудности с выполнением длительных аэробных тренировок?',
        options: [
            {label: 'Да', values: [1, 1, 2, 2]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Есть ли у пациентки когнитивные нарушения?',
        options: [
            {label: 'Да', values: [3, 3, 1, 1]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Есть ли признаки полинейропатии?',
        options: [
            {label: 'Да', values: [3, 3, 1, 1]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Есть ли заболевания сердечно-сосудистой системы?',
        options: [
            {label: 'Да', values: [3, 2, 1, 1]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Проводилось ли лечение антрациклинами, платиной, HER2-препаратами или лучевая терапия?',
        options: [
            {label: 'Да', values: [3, 2, 1, 1]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Проводилось ли лечение ингибиторами ароматазы?',
        options: [
            {label: 'Да', values: [1, 1, 3, 2]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Проводилось ли лечение препаратами иммунотерапии?',
        options: [
            {label: 'Да', values: [2, 1, 1, 1]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Какую дистанцию прошла пациентка за 6 минут ходьбы?',
        options: [
            {label: 'Более 551 м', values: [1, 1, 3, 3]},
            {label: '426–550 м', values: [2, 1, 2, 2]},
            {label: '301–425 м', values: [3, 2, 1, 1]},
            {label: 'Менее 300 м', values: [3, 3, 1, 1]},
            {label: 'Нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Прошла ли пациентка большее расстояние на 6-й минуте по сравнению с 1-й?',
        options: [
            {label: 'Да', values: [2, 2, 1, 3]},
            {label: 'Нет', values: [1, 1, 1, 1]},
            {label: 'Нет информации', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Результаты динамометрии доминантной руки у пациентки',
        options: [
            {label: '25 кг и более', values: [1, 1, 1, 2]},
            {label: '20–24 кг', values: [1, 2, 2, 1]},
            {label: 'менее 19 кг', values: [1, 1, 3, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Толщина кожно-жировой складки на плече',
        options: [
            {label: 'более 14,9 мм', values: [3, 3, 1, 3]},
            {label: '13,2–14,8 мм', values: [2, 3, 2, 2]},
            {label: '9,9–13,1 мм', values: [1, 2, 3, 1]},
            {label: 'менее 9,8 мм', values: [1, 1, 3, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Окружность мышц плеча',
        options: [
            {label: '22,8 см и более', values: [3, 3, 1, 3]},
            {label: '20,2–22,7 см', values: [2, 3, 2, 2]},
            {label: '15,2–20,1 см', values: [1, 2, 3, 1]},
            {label: 'менее 15,2 см', values: [1, 1, 3, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Показатели ИМТ',
        options: [
            {label: 'менее 18,4 кг/м²', values: [1, 1, 3, 1]},
            {label: '18,5–25 кг/м²', values: [2, 2, 2, 1]},
            {label: '25–30 кг/м²', values: [3, 3, 1, 2]},
            {label: 'более 30 кг/м²', values: [3, 3, 1, 3]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Данные ЭхоКГ — ФВЛЖ',
        options: [
            {label: 'более 53%', values: [1, 1, 1, 1]},
            {label: 'менее 52%', values: [3, 1, 1, 1]},
            {label: 'снижение на 10% и более за 3 месяца', values: [3, 1, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Данные ЭхоКГ — GLS',
        options: [
            {label: 'более 19%', values: [1, 1, 1, 1]},
            {label: '17–18%', values: [3, 2, 1, 1]},
            {label: 'менее 16%', values: [3, 2, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Тропонин I',
        options: [
            {label: 'менее 0,025 нг/мл', values: [1, 1, 1, 1]},
            {label: 'более 0,026 нг/мл', values: [3, 1, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'BNP',
        options: [
            {label: 'менее 35 пг/мл', values: [1, 1, 1, 1]},
            {label: 'более 36 пг/мл', values: [3, 1, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'NT-proBNP',
        options: [
            {label: 'менее 125 пг/мл', values: [1, 1, 1, 1]},
            {label: 'более 126 пг/мл', values: [3, 1, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Эритроциты (общий анализ крови)',
        options: [
            {label: 'более 3,8 × 10^12/л', values: [1, 1, 1, 1]},
            {label: 'менее 3,7 × 10^12/л', values: [3, 2, 1, 2]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Гемоглобин',
        options: [
            {label: 'более 120 г/л', values: [1, 1, 1, 1]},
            {label: 'менее 119 г/л', values: [3, 2, 1, 2]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Малоновый диальдегид',
        options: [
            {label: '0,45–1,7 нмоль/мл', values: [1, 1, 1, 1]},
            {label: 'более 1,8 нмоль/мл', values: [3, 2, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: '8-OH-дезоксигуанозин',
        options: [
            {label: '0,1–0,3 нг/мл', values: [1, 1, 1, 1]},
            {label: 'более 0,4 нг/мл', values: [3, 2, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Супероксиддисмутаза',
        options: [
            {label: '164–240 ед/мл', values: [1, 1, 1, 1]},
            {label: 'менее 164 ед/мл', values: [3, 2, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Глутатионпероксидаза',
        options: [
            {label: '4171–10881 Ед/л', values: [1, 1, 1, 1]},
            {label: 'менее 4171 Ед/л', values: [3, 2, 1, 1]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Инсулин',
        options: [
            {label: '5–7 мкЕД/мл', values: [1, 1, 1, 1]},
            {label: 'менее 5 мкЕД/мл', values: [1, 1, 2, 3]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    },
    {
        text: 'Глюкоза',
        options: [
            {label: '3,3–5,7 ммоль/л', values: [1, 1, 1, 1]},
            {label: 'более 5,8 ммоль/л', values: [1, 1, 2, 3]},
            {label: 'нет данных', values: [0, 0, 0, 0]}
        ]
    }
];
